## Import pandas

In [3]:
import pandas as pd

## Create DataFrame

In [37]:
mydict = {
    "developer_id": ["001", "002", "003", "004", "005", "006"],
    "name": ["Thomas", "Lothar", "Andrew", "John", "Elon", "Steve"],
    "age": [36, 48, 21, 44, 18, 27],
    "salary": [60000, 90000, 50000, 120000, 90000, 110000],
    "country": ["Germany", "Germany", "United States", "Scotland", "United States", "United States"],
    "city": ["Berlin", "Munich", "Boston", "Edinburgh", "New York", "San Francisco"],
}

df_dev = pd.DataFrame(mydict)
df_dev

  developer_id    name  age  salary        country           city
0          001  Thomas   36   60000        Germany         Berlin
1          002  Lothar   48   90000        Germany         Munich
2          003  Andrew   21   50000  United States         Boston
3          004    John   44  120000       Scotland      Edinburgh
4          005    Elon   18   90000  United States       New York
5          006   Steve   27  110000  United States  San Francisco

## Group by Size

In [52]:
df_group_size = df_dev.groupby(by=["country"]).size().reset_index(name='number_dev')
df_group_size = pd.DataFrame(df_group_size)
df_group_size.sort_values(by="number_dev", ascending=False, inplace=True)
df_group_size

         country  number_dev
2  United States           3
0        Germany           2
1       Scotland           1

## Group by Count

In [53]:
df_group_count = df_dev.groupby(by=["country"])["developer_id"].count().reset_index(name='number_dev')
df_group_count = pd.DataFrame(df_group_count)
df_group_count.sort_values(by="number_dev", ascending=False, inplace=True)
df_group_count

         country  number_dev
2  United States           3
0        Germany           2
1       Scotland           1

## Group by Mean

In [54]:
df_group_mean = df_dev.groupby(by=["country"])["age"].mean().reset_index(name='mean_age')
df_group_mean = pd.DataFrame(df_group_mean)
df_group_mean.sort_values(by="mean_age", ascending=False, inplace=True)
df_group_mean

         country  mean_age
1       Scotland        44
0        Germany        42
2  United States        22

## Group by Sum

In [55]:
df_group_sum = df_dev.groupby(by=["country"])["salary"].sum().reset_index(name='sum_salary')
df_group_sum = pd.DataFrame(df_group_sum)
df_group_sum.sort_values(by="sum_salary", ascending=False, inplace=True)
df_group_sum

         country  sum_salary
2  United States      250000
0        Germany      150000
1       Scotland      120000